<script setup>
import {
  ArticleLayout,
  ArticleHeader,
  ArticleText,
  ArticleDisclosure,
  ArticleCallout,
  ArticleFigure,
  ArticleGallery,
  ArticleSources,
} from '@/components/article'


import { articles } from '@/data/articles.js'
import { beforeRunPhotos, duringRunPhotos } from '@/data/article-media/kakao-friends-run-2026.js'

const article = articles.find(
  ({ slug }) => slug === 'kakao-friends-run-2026',
)
</script>

<template>
    <ArticleLayout>
        <ArticleHeader
        :title="article.title"
        :description="article.description"
        :date="article.date"
        />
        <ArticleText>
            SKALA 부트캠프에서 나오며 선택과 집중의 시간을 가지려 했다.
            부트캠프 선택의 기준은 초스피드로 풀스택과 AI 관련 서비스 역량을 기를 수 있다는 속도였다. 다만, 그 속도가 오히려 독이 되었다.
            배운 내용을 구현과 하드코딩은 AI에게 맡기더라도 구조와 흐름은 설계할 수 있어야 내 것이라고 보았다.
            이 게시물을 만들면서 느끼는 것은, 간단한 웹 서비스라도 많은 양의 코드와 복잡한 폴더 구조가 필요하다는 점이다.
            풀스택으로 갈수록 읽어야 할 코드 양이 많아져 직접 보지 않고, AI를 통해 과제 코드를 이해해야 했다.
            이것은 명백히 실력 향상이 아니다. AI가 제시하는 이해의 관점을 그저 받아들이고 있기 때문이다.
            실력이 생겼다면 코드를 볼 수 있는 눈이 생겨야 한다. 그래야 AI에게 시키는 것도 잘할 수 있다.
            개인 프로젝트에서 배운 내용을 하나씩 응용해가며 그 구조를 스스로 그려보는 게 가장 도움이 된다고 봤다.
            중도 퇴소가 큰 비용이 있는 선택이었음에도, 나와서 개인 프로젝트에 집중하고, 채용 공고에 더 신경 써보는게 좋을 수 있다고 생각했다.
        </ArticleText>

        <ArticleText>
            누구나 맞아보기 전엔 계획이 있다는 말처럼, 막상 나오니 내 의지로 그 계획을 실천하는 일은 어려웠다.
            하려던 일을 미루고, 그 일에 실패하고, 스스로 자책하고, 다음 일도 더 안 되는 수렁에 빠졌다.
            이 악순환을 끊기 위해 오히려 나는 나에게 제대로 된 휴식을 주기로 했다.
        </ArticleText>

        <ArticleText>
            애정하는 영화 "매트릭스"의 "메로빈지언"의 인과율과 선택의 허상에 대한 대사를 빌려오면
        </ArticleText>

        <ArticleCallout title="The Matrix Reloaded">
            "Who has time? Of course, no one. But if we never take time, how can we ever have time?"
            <br>
            "누가 시간이 있겠나? 당연히 아무도 없지. 하지만 우리가 시간을 내지 않는다면, 어떻게 시간을 가질 수 있겠나?"
        </ArticleCallout>

        <ArticleText>
            망해서 열심히 해야 한다는 건 알지만, 오히려 그 압박과 관성을 멈추기 위해서라도, 시간을 일부러 만들어야 한다.
            카카오프렌즈 런 2026은 SKALA를 나오며, 참석을 거의 포기했었다. 판교에 살았다면 괜찮지만 대전에서 놀고 오면 하루를 쓰기 때문이다.
            그렇지만 가서 리프레시도 하고, Strava로 러닝 GPS 데이터도 만들어 게시물 쓸 건덕지로 쓰면 된다고 스스로를 설득했다.
        </ArticleText>

        <ArticleText>
            새벽 4시에 기상했다. 가는 데 1시간 40분이 걸렸기 때문이다.
            처음엔 발걸음이 무거웠지만, 출발해서 짊어지고 있던 고민들과 헤어지며 점차 가볍게 변했다.
            해가 뜨기 전이 가장 어둡다고 했던가. 지금 내 상황인 것 같아 공감이 되던 말인데, 운전으로 체감할 수 있었다.
            다들 새벽부터 어딜 그리 가는지..

        </ArticleText>

        <ArticleText>
            참석자가 만 명이 넘는 큰 행사라서 도착지는 매우 혼잡했다. 
            800m를 남기고, 차가 움직이질 않아서 권장 집합 시간인 7시가 넘어 아빠한테 차를 바통터치하고 걸어갔다.
            같은 연노랑 유니폼과 모자, 양말을 신은 사람들이 물결을 이뤘다.
            탄천종합운동장에 들어가자 이미 많은 사람들이 와 있었다. 박지혜 아나운서가 앞에서 준비운동을 이끌고 있었다.
            들어보니 러닝 대회에는 꼭 참가해서 진행을 하시는 러닝 마니아라고 한다.
            부스는 아직 준비 중이었고, 대신 포토존은 줄이 있었다. 뛰기 전 사진을 남기고파 몇 장 찍었다.
            가방에서 참가자 굿즈로 받은 테이크핏 Booster를 먹었다. 곤약젤리 같은 식감을 예상했는데, 잼 같은 질감이었다.
            맛없을 줄 알고 한 입에 털어 넣었는데, 약간 맛있어서 천천히 녹여 먹을 걸 후회가 됐다.
            가져간 바람막이는 벗었다. 10월인데 기온은 여름에 못지않았기 때문이다.
            굿즈로 받은 간식이 남아있는 가방을 들고, 유튜버 한스님처럼 먹방런을 할지 잠시 고민했다가 물품보관소에 짐을 넣기로 했다.
        </ArticleText>

        <ArticleGallery :items="beforeRunPhotos" />

        <ArticleText>
            러닝 대회가 인생 처음이라 긴장이 되었다. 이런 맘을 알기라도 한 듯이, 익살스런 간이 악단이 가는 길을 풀어줬다.
            사람이 빽빽해서 뛸 수나 있나 싶었다. 왠지 혼자 온 사람은 많지 않은 것 같아 조금 머쓱했다.
            출발하니 출근길 지하철의 끈적한 유동인구 같은 느낌으로 사람들이 움직였다. 또, 사람이 많다보니 땅이 발 디디는 소리로 울렸다.
            약간 시간이 지나니, 천천히 뛰는 사람들과 빨리 뛰는 사람들이 크로마토그래피처럼 분리되었다.
            난 기록 욕심은 없었다. 대신 Strava로 러닝 데이터를 측정하고, 사진을 많이 찍어 카카오맵으로 뛴 과정을 시각화해야 한다는 목표가 있었다.
            응원해주시는 스태프분들, 건너편에서 돌아오고 있는 10km 러너분들, 같이 뛰고 있는 5km 러너분들 모두 진심인 듯 했다.
            그 속에서 특이사항마다 멈춰서 사진이나 동영상을 남기는 내가 눈치가 보였다.
            코스는 잔잔한 아스팔트 도로였다. 옛날에 뛰던 탄천 코스 옆 도로라서 낯선 듯 친숙했다.
            커브길 위에 단체로 뛰는 모습이 그림 같아서 사진을 남겼다. 새벽엔 안개가 좀 있었는데, 뛸 때는 구름 약간 있는 청명한 하늘이었다.
            아침에 운전을 하며 와서 그런지, 컨디션은 엄청 좋진 않았다. 그래도, 반환점까지 가는 데 지치진 않았다.
            바람막이는 벗고 오길 잘했다. 땀이 많이 났고, 쿨링팬 구역에서 분사된 물로 체온을 낮췄다.
            눈에 띄는 참가자가 있었다. 잃어버린 반려동물을 찾는 전단지를 등에 붙이고 뛰는 사람이었다. 많이 안타까웠다.
            4km쯤 되니까, 약간 체력적으로 힘들어졌다. 사진과 동영상 촬영으로 일정하게 뛰지 못해서이다.
            급수대에서 파워에이드 나눠주는 모습이 보였다. 지금까지 뛰면서 중간에 음료수를 먹었던 적이 없어서 마셔보고 싶은 마음이 컸다.
            그런데, 막상 마셔보니 괜히 마셨다는 생각이 들었다.  뛰느라 무슨 맛인지 잘 모르겠고, 속에서 찰랑거리는 게 거슬렸다.
            진심으로 뛰진 않았다고 하지만, 그렇다고 너무 쉽게 뛴 것도 아니라서 막판 스퍼트로 기록을 내고 싶었다.
            더는 새롭게 찍어볼 것이 없다는 생각이 들어, 전력으로 뛰었다. 결승라인에 이르니 오랜만에 입안에 쇠맛이 느껴졌다.
            회복하느라 정신없어 걷다가 Strava 기록을 멈춰야 한다는 사실을 깨닫고 빠르게 처리했다. 아쉽게 1~2분이 지난 것처럼 보였다.
            나중에 어떻게 처리할지 머리가 좀 아팠다가, 시작점에 이르고 완주 기념품들을 받았다.
            참가자 굿즈도 정말 많이 준다고 생각했는데 그것이 끝이 아니라 완주 기념품도 상당한 양이었다.
        </ArticleText>

        <ArticleGallery :items="duringRunPhotos"/>

        <ArticleText>
            25분 37초. IT 회사답게 결승점을 지나자 배번표에 있는 태그를 인식해서 기록을 확정하고, 핸드폰으로 그 결과를 전송해준다.
            완주 기념 포토존은 구불구불한 대기열 속을 러닝머신처럼 계속 걸어 다니는 새로운 레이스 같았다.
            단상마다 다른 후원 기업 로고가 붙어있었다. 딱히 원하는 로고는 없었지만, 배정받은 단상이 마음에 들진 않았다.
            스태프가 참가 번호를 입력하자, 단상 속 전광판에 내 기록이 올라왔다. 긍정적 의미로 데이터 파이프라인을 통과하는 데이터가 된 기분이었다.
            6분 페이스를 생각했는데, 더 빨리 들어와서 기분이 좋았다. 다음 대회에선 4분 페이스를 성취할 수 있도록 계속 러닝을 이어갈 것이다.
            숨을 고르고 쉬다 보니 다양한 부스가 눈에 들어왔다. 모든 부스를 방문해볼 의도로 제일 먼 곳부터 가 보았다.
            카카오페이증권의 부스였다. 줄이 생각보다 길고, 다른 부스들도 비슷하거나 더 길었다. 
            결혼을 주제로 부스를 꾸며 놓았다. 올해 결혼한 부부에게 주식을 선물로 주는 프로모션을 진행하고 있었다.
            부케를 던져 먼 곳에 있는 통 속에 넣거나, 회전판에서 선택한 카카오프렌즈가 걸리면 상품을 줬다.
            나는 부케와 회전판 모두 실패했다. 낙담해서 나가려는데 골드바 초콜릿과 꽝 없는 주식 응모권을 참가상으로 받았다.
            나중에 응모권을 확인해 보니, 삼성전자 3000원이었다. 주 단위가 아닌 금액 단위로 주식을 살 수 있는 기능이 흥미로웠다.
            다음으로 들른 곳은 ChatGPT for Kakao 부스였다. 바로 옆 부스였는데, 가장 줄이 긴 곳 중 하나였다.
            펌프 기계 같은 발판 위에서 제자리 달리기를 해서 앞에 전광판의 불빛을 키면 단계별로 상품을 준다.
            가장 어려운 5단계는 1명만 선착순으로 받긴 하지만, 무려 GARMIN이다. 사실 GPS 데이터를 다루며 장비의 중요성을 느끼고 있어서 탐이 났다.
            GARMIN이 러너용 스마트워치를 만드는 회사로 알려져 있는데, 원래는 내비게이션을 비롯하여 군사, 선박, 항공 등 여러 분야의 GPS를 전문으로 하는 기업이다.
            그런데, 줄이 절반쯤 줄어드니 진행자가 1, 2, 3등 상품이 다 품절되었다고 알렸다.
            기다려보니 어차피 모든 부스를 다 갈 수 없다는 걸 깨닫기도 해서, 이럴 줄 알았으면 가장 좋아 보이는 곳에 먼저 갈 걸 하고 후회했다.
            김이 새서 4단계만 달성하고 팔토시를 받았다. 카카오 측 부스 중에는 죠르디의 취업대작전이라는 부스도 있어서 관심이 갔었다.
            하지만, 놀러 와서까지 취업을 걱정하고 싶진 않았다. 물론 여기 온 목적 중에는 포트폴리오용 데이터 생성이 있긴 했지만.
            그것보다는 후원 기업 부스에서 상품 받는 게 끌렸다. 특히, 평소에도 '참치는 못 참치'를 외치고 다니는 사람이라 동원 부스는 꼭 가고 싶었다. 
            동원 부스의 줄을 서며, 조금 배가 고파서 받은 완주 기념품을 살펴봤다. 
            한 번도 먹어보지 않은 과자인 농심 '누룽지팝'이 눈에 띄었다. 카카오가 머리를 잘 쓴 게 이렇게 격렬하게 운동하고 먹는 음식이 기억에 오래가는 법이다.
            오리온의 '뉴룽지'를 좋아하는 나라서 약간 기대를 하고 먹었다. 역시 라면 만드는 유탕 처리 기술이 좋아서 MSG와 기름, 누룽지의 조화가 절묘했다.
            무대에선 장기자랑으로 상품을 주는 행사가 한창이었다. 달려서 힘들 텐데 지치지도 않고, 춤추는 모습을 보며 자본주의의 무서움을 느꼈다.
            그런데, 진짜 공포는 따로 있었다. 옆에 양반 부스는 인간 슬롯머신을 운영하고 있었다. 
            SNS에서만 볼 수 있는 귀한 것인데, 효과음까지 짱짱해서 도대체 얼마를 받길래 저 일을 하고 계신 건지 궁금해졌다.
            그렇게 동원 부스에서 내 차례가 오고, 공을 던져 먼 곳에 있는 벽에 뚫린 참치 캔 모양 구멍에 넣는 게임을 했다.
            러닝 후 단백질 채울 생각에 욕심이 나서 승부욕에 불타 열심히 했다. 하지만, 운동 신경이 둔해진 탓일까? 참치 캔 1개를 받는 것에 그쳤다.
            종합적으로 볼 때, 부스를 통해서도 잘만 하면 얻어 가는 게 많다. 오랜만에 동심으로 돌아갈 수 있었다. 
        </ArticleText>

        <ArticleText>
            어느 정도 시간이 지났을 때, 무대에서 진행자가 축하 공연으로 온 가수의 라인업을 알렸다.
            존박 님과 리센느가 왔다. 예전에 SKALA 팀원들과 사이트에 나온 실루엣으로 키키일 것 같다고 했는데, 과분한 캐스팅이었다. 8만 원으로 이 정도 호사를 누릴 수 있다니!
            키키가 올 것 같아서 일부러 404 같은 곡들을 들었는데 헛수고였다. 리센느에는 큰 관심이 없었는데, 최근에 '거제 야호'로 알게 되었다.
            뜬금없는 파라파라 춤과 낚시의 조합이 신선했다. 그런 우연한 만남이야말로 삶에서 추구할 가치라고 생각한다.
            존박 님이 먼저 공연을 하셨다. 한로로의 '0+0', '네 생각' 등의 곡들을 불러주셨다. 나에게 건네주는 위로 같은 느낌을 받았다.
            가장 마음에 훅 들어온 가사는
        </ArticleText>

        <ArticleCallout title="한로로 '0+0'">
            아, 난 널 버리지 않아
            <br>
            너도 같은 생각이지?
            <br>
            난 우리를 영영 잃지 않아..
        </ArticleCallout>

        <ArticleText>
            곡 해석을 보기 전에는 연인을 붙잡는 말로 느꼈다. 0과 0이 만나도 숫자가 커지진 않는다. 하지만, 영원($\infty$)을 꿈꿀 수 있다.
            함께의 가치를 의미하던 것이다. 한로로 님이 '자몽살구클럽'이라는 소설과 같이 이 곡이 수록된 앨범을 만들었다고 한다.
            각 곡은 소설의 내용을 설명한다고 하니, 꼭 읽어봐야 할 책으로 정했다.
            소설 작가의 말에서 국어국문학 전공을 제대로 살리는 건 이번이 처음이라 엄청난 두려움에 떨며 책을 냈다고 한다.
            나는 진정한 재능은 학문의 경계를 뛰어넘으며 발휘할 수 있다고 생각한다.
            나의 사고가 글과 수식과, 다른 매체들로 다양하게 나타나고 서로 합쳐져 입체적인 유일함을 보여줄 수 있다.
            그것이 수고로움을 감수하고 이 포트폴리오를 만든 이유 중 하나이다.
        </ArticleText>

        <ArticleText>
            드디어 오늘 축제의 화룡점정인 리센느의 공연이 시작됐다. 들으면서 이 곡도 리센느 곡이었구나 알게 된 것들도 있었다.
            러닝하며 나도 모르게 덕택을 보고 있던 것이다. 무대 앞자리를 선점하지 못한 게 약간 아쉬웠다.
            청바지 재질의 멜빵에 흰 반팔 티를 입은 모습이 멀리서도 그 외모가 느껴졌다. 한 번씩 시원한 물 축포가 공연장의 열기를 식혀주고 분위기를 고조시켰다. 
            'Love Attack', 'Pretty Girl', 'Deja vu' 등 신나게 즐길 수 있는 곡들로 무대가 끝이 났다.
            공연이 정리되고, 경품 추첨의 시간을 가졌다. 뽑는 조건이 가장 어린 몇 명, 오늘 생일인 사람 등 꽤 특이했다.
            경품에 큰 미련이 없게 넉넉하게 받은 게 많기도 했고, 나가는 교통이 걱정되기도 해서 중간에 나왔다.
            차로 돌아가기 위해 탄천을 건너며 다리 아래 물가에서 잉어 무리를 맞닥뜨렸다.
            SKALA 시절, 탄천 러닝을 하며 만난 너구리와 참게와의 추억으로 마무리할 수 있는 축제였다.
        </ArticleText>
    </ArticleLayout>
</template>