<script setup>
import {
  ArticleLayout,
  ArticleHeader,
  ArticleText,
  ArticleDisclosure,
  ArticleCallout,
  ArticleFigure,
  ArticleGallery,
  ArticleVideo,
  ArticleSources,
  ArticleYouTube,
} from '@/components/article'


import { KakaoFriendsRunMap } from '@/components/map/kakao-friends-run-2026'
import { articles } from '@/data/articles.js'
import { afterRunPhotos, beforeRunPhotos, bootcampScreenshots, duringRunPhotos, johnParkIntroVideo, ResceneIntroVideo } from '@/data/article-media/kakao-friends-run-2026.js'

const article = articles.find(
  ({ slug }) => slug === 'kakao-friends-run-2026',
)
</script>

<template>
    <ArticleLayout>
        <ArticleHeader
        :title="article.title"
        :description="article.description"
        :date="article.date"
        />
        <ArticleText>
            SKALA 부트캠프에서 나오며 선택과 집중의 시간을 가지려 했다.
            지난 상반기, 취준 기간을 집에서 보내기가 부모님께 죄송스러워서, 부트캠프 입과를 계획했다.
            SKALA뿐 아니라 SSAFY, 소프티어까지 메이저한 곳들로 지원했다. 면접과 코딩테스트 연습을 하는 셈 치고 밑져야 본전이라 생각하고 임했다.
            감사하게도 3곳 모두 합격을 주셨다.
        </ArticleText>

        <ArticleGallery :items="bootcampScreenshots"/>

        <ArticleText>
            문제는 각 부트캠프마다 장단점이 있다는 것이다. 
            나는 전공자이지만, 이론 위주의 학습을 해왔기에 개발 실무를 잘하진 않았다.
            그래서, 기초부터 배우기엔 아깝고, 실무부터 하기엔 좋은 결과를 만들 자신이 없었다.
            도메인은 모빌리티가 가장 적합했고, AI를 활용한 서비스 개발은 학부 프로젝트 경험으로 볼 때, 내 적성에 맞지 않았다.
        </ArticleText>

        <ArticleFigure caption="부트캠프 비교">
            <ArticleText>
                $$
                \begin{array}{c|c|c|c}
                \textbf{기준}
                & \textbf{SKALA}
                & \textbf{SSAFY}
                & \textbf{소프티어} \\ \hline

                \text{도메인}
                & \text{AI · SW 서비스}
                & \text{SW 전반}
                & \text{모빌리티} \\

                \text{위치}
                & \text{타지 자취}
                & \text{대전 통학}
                & \text{타지 자취} \\

                \text{지원금}
                & \text{많음}
                & \text{많음}
                & \text{없음} \\

                \text{실질 비용}
                & \text{자취비로 상쇄}
                & \text{없음}
                & \text{자취비 부담} \\

                \text{교육 기간}
                & \text{6개월}
                & \text{1년}
                & \text{2개월} \\

                \text{취업 연계}
                & \text{약 30\%}
                & \text{채용 연계 없음}
                & \text{서류 전형 면제}
                \end{array}
                $$
            </ArticleText>
        </ArticleFigure>

        <ArticleText>
            부트캠프 선택의 기준은 빠르게 서비스 역량을 기를 수 있는지였다. 개발 역량 없이는 지원할 수 있는 직무가 제한되었기 때문이다.
            SSAFY는 CS와 코딩테스트에 시간을 6개월 쓰기 때문에 부담이 됐고, 소프티어는 2개월 안에 실무를 익혀서 실력을 높이긴 어려울 것 같았다.
            그렇게 SKALA에 입과하게 되었다. 초반에는 의도대로 개발 역량을 차곡차곡 쌓을 수 있었다.
            하지만, 풀스택으로 갈수록 읽을 코드가 많아지고 점점 더 AI에 의존해야만 진도를 따라갈 수 있었다.
            나는 배운 내용을 구현과 하드코딩은 AI에게 맡기더라도 구조와 흐름은 설계할 수 있어야 실력이 향상되었다고 생각한다.
            AI가 제시하는 이해의 관점을 그저 받아들인다면 그 지식은 머릿속에서 쉽게 휘발되기에 남는 게 적다고 판단했다.
            중도 퇴소가 큰 비용이 있는 선택이었음에도, 나와서 개인 프로젝트에 집중하고, 채용 공고에 더 신경 써 보는 게 좋을 수 있다고 생각했다.
        </ArticleText>

        <ArticleText>
            누구나 맞아보기 전엔 계획이 있다는 말처럼, 막상 나오니 내 의지로 그 계획을 실천하는 일은 어려웠다.
            하려던 일을 미루고, 그 일에 실패하고, 스스로 자책하고, 다음 일도 더 안 되는 수렁에 빠졌다.
            이 악순환을 끊기 위해 오히려 나는 나에게 제대로 된 휴식을 주기로 했다.
        </ArticleText>

        <ArticleText>
            애정하는 영화 "매트릭스"의 "메로빈지언"의 인과율과 선택의 허상에 대한 대사를 빌려오면
        </ArticleText>

        <ArticleCallout title="The Matrix Reloaded">
            "Who has time? Of course, no one. But if we never take time, how can we ever have time?"
            <br>
            "누가 시간이 있겠나? 당연히 아무도 없지. 하지만 우리가 시간을 내지 않는다면, 어떻게 시간을 가질 수 있겠나?"
        </ArticleCallout>

        <ArticleYouTube
        video-id="d2mRQmijMLM"
        caption="메로빈지언의 인과율"
        />

        <ArticleText>
            망해서 열심히 해야 한다는 건 알지만, 오히려 부정적 관성을 멈추기 위해서라도, 시간을 일부러 만들어야 했다.
            카카오프렌즈 런 2026은 SKALA를 나오며, 참석을 거의 포기했었다. 판교에 살았다면 괜찮지만 대전에서 놀고 오면 하루를 쓰기 때문이다.
            하지만, 리프레시도 하고, Strava로 러닝 GPS 데이터도 만들어 게시물을 쓰면 된다고 스스로를 설득했다.
        </ArticleText>

        <ArticleText>
            새벽 4시에 기상했다. 가는 데 1시간 40분이 걸렸기 때문이다.
            처음엔 발걸음이 무거웠지만, 출발하고 짊어진 고민들과 헤어지며 가볍게 변했다.
            해가 뜨기 전이 가장 어둡다고 했던가. 내가 처한 상황인 것 같아 공감이 된 말인데, 운전으로 체감할 수 있었다.
            참석자가 만 명이 넘는 큰 행사라서 도착지는 매우 혼잡했다. 
            800m를 남기고, 차가 움직이질 않아서 권장 집합 시간인 7시가 넘어 아빠한테 차를 바통터치하고 걸어갔다.
            같은 연노랑 유니폼과 모자, 양말을 신은 사람들이 물결을 이뤘다.
            탄천종합운동장에 들어가자 이미 많은 사람들이 와 있었다. 러닝 매니아 박지혜 아나운서가 앞에서 준비운동을 이끌고 있었다.
            부스는 아직 준비 중이었고, 포토존은 줄이 있었다. 뛰기 전 사진을 남기고파 몇 장 찍었다.
            가방에서 참가자 굿즈로 받은 테이크핏 Booster를 먹었다. 곤약젤리 같은 식감을 예상했는데, 잼 같은 질감이었다.
            맛없을 줄 알고 한 입에 털어 넣었는데, 맛있어서 천천히 녹여 먹을 걸 후회가 됐다.
            가져간 바람막이는 벗었다. 10월인데 기온은 여름에 못지않았기 때문이다.
            굿즈로 받은 간식이 남아있는 가방을 들고, 유튜버 한스님처럼 먹방런을 할지 고민했다가 물품보관소에 짐을 넣기로 했다.
        </ArticleText>

        <ArticleGallery :items="beforeRunPhotos" />

        <ArticleText>
            러닝 대회가 인생 처음이라 긴장이 되었다. 이런 마음을 익살스런 간이 악단이 풀어줬다. 혼자 온 사람은 많지 않은 것 같아 머쓱했다.
            출발하니 빽빽했던 인구가 크로마토그래피처럼 천천히 뛰는 사람들과 빨리 뛰는 사람들로 분리되었다.
            난 기록 욕심은 없었다. 대신 Strava로 러닝 데이터를 측정하고, 사진을 많이 찍어 카카오맵으로 뛴 과정을 시각화해야 한다는 목표가 있었다.
            응원해주시는 스태프분들, 건너편에서 돌아오고 있는 10km 러너분들, 같이 뛰고 있는 5km 러너분들 모두 진심인 듯했다.
            그 속에서 특이사항마다 멈춰서 사진이나 동영상을 남기는 내가 눈치가 보였다.
            코스는 잔잔한 아스팔트 도로였다. 옛날에 뛰던 탄천 코스 옆 도로라서 낯선 듯 친숙했다.
            커브길 위에 단체로 뛰는 모습이 그림 같아서 사진을 남겼다. 새벽엔 안개가 좀 있었는데, 뛸 때는 구름 약간 있는 청명한 하늘이었다.
            바람막이는 벗고 오길 잘했다. 땀이 많이 났고, 쿨링팬 구역에서 분사된 물로 체온을 낮췄다.
            눈에 띄는 참가자가 있었다. 잃어버린 반려동물을 찾는 전단지를 등에 붙이고 뛰는 사람이었다. 많이 안타까웠다.
            4km쯤 되니까, 약간 체력적으로 힘들어졌다. 사진과 동영상 촬영으로 일정하게 뛰지 못해서이다.
            급수대에서 파워에이드 나눠주는 모습이 보였다. 지금까지 뛰면서 중간에 음료수를 먹었던 적이 없어서 마셔보고 싶은 마음이 컸다.
            그런데, 막상 마셔보니 괜히 마셨다는 생각이 들었다. 뛰느라 무슨 맛인지 잘 모르겠고, 속에서 찰랑거리는 게 거슬렸다.
            막판에 와서는 더 새롭게 찍을 것이 없다는 생각이 들어, 전력으로 뛰었다. 결승라인에 이르니 오랜만에 입안에 쇠맛이 느껴졌다.
            회복하느라 정신없이 걷다가 Strava 기록을 멈춰야 한다는 사실을 깨닫고 빠르게 처리했다. 아쉽게 1~2분이 지난 것처럼 보였다.
            시작점에 이르고 완주 기념품들을 받았다. 참가자 굿즈도 정말 많이 준다고 생각했는데 그것이 끝이 아니라 완주 기념품도 상당한 양이었다.
        </ArticleText>

        <ArticleGallery :items="duringRunPhotos"/>

        <KakaoFriendsRunMap />

        <ArticleText>
            25분 37초. IT 회사답게 결승점을 지나자 배번표 태그를 인식해서 기록을 확정하고, 핸드폰으로 결과를 전송해 준다.
            스태프가 참가 번호를 입력하자, 단상 아래 전광판에 기록이 올라왔다. 긍정적 의미로 데이터 파이프라인을 통과하는 데이터가 된 기분이었다.
            6분 페이스를 생각했는데, 더 빨리 들어와서 기분이 좋았다. 숨을 고르니 다양한 부스가 눈에 들어왔다. 먼저 카카오페이증권 부스부터 방문했다. 
            결혼을 주제로 부스를 꾸며 놓았다. 부케를 던져 먼 곳에 있는 통 속에 넣거나, 회전판에서 선택한 카카오프렌즈가 걸리면 상품을 줬다.
            나는 부케와 회전판 모두 실패했다. 낙담해서 나가려는데 골드바 초콜릿과 꽝 없는 주식 응모권을 참가상으로 받았다.
            나중에 응모권을 확인해 보니, 삼성전자 3000원이었다. 주 단위가 아닌 금액 단위로 주식을 살 수 있는 기능이 흥미로웠다.
            다음은 ChatGPT for Kakao 부스였다. 바로 옆 부스였는데, 가장 줄이 긴 곳 중 하나였다.
            펌프 기계 같은 발판 위에서 제자리 달리기를 해서 앞에 전광판의 불빛을 키면 단계별로 상품을 준다.
            가장 어려운 5단계는 선착순으로 1명에게 GARMIN을 줬다. GPS 데이터를 다루며 장비의 중요성을 느껴서 탐이 났다.
            GARMIN이 러너용 스마트워치를 만드는 회사로 알려져 있는데, 원래는 군사, 선박, 항공 등 여러 분야의 GPS를 전문으로 하는 기업이다.
            그런데, 줄이 절반쯤 줄어드니 진행자가 5, 4, 3단계 상품이 다 품절되었다고 알렸다. 이럴 줄 알았으면 여기를 첫번째로 갈 걸 하고 후회했다.
            김이 새서 2단계만 달성하고 팔토시를 받았다. 카카오 측 부스 중에는 죠르디의 취업대작전이라는 부스가 가장 특이했다.
            하지만, 놀러 와서까지 취업을 걱정하고 싶진 않았다. 대신 후원 기업 부스에서 상품 받는 게 더 끌렸다. 
            특히, 평소에도 '참치는 못 참치!'를 외치고 다니는 사람이라 동원 부스는 꼭 가고 싶었다. 
            동원 부스의 줄을 서며, 배가 고파서 받은 완주 기념품을 살펴봤다. 처음보는 과자인 농심 '누룽지팝'이 보였다. 
            카카오가 머리를 잘 쓴 게 격렬한 운동을 하고 먹는 음식이 기억에 오래가는 법이다.
            오리온의 '뉴룽지'를 좋아해서 기대를 하고 먹었다. 라면 만드는 유탕 처리 기술로 만든 MSG와 기름, 누룽지의 조화가 절묘했다.
            무대에선 장기자랑으로 경품을 주는 행사가 한창이었다. 달려서 힘들 텐데 지치지도 않고, 춤추는 모습을 보며 자본주의의 무서움을 느꼈다.
            그런데, 진짜 공포는 양반 부스가 운영하는 인간 슬롯머신이었다. SNS에서만 봤던 귀한 것인데, 효과음까지 육성이라 눈길이 갔다.
            동원 부스에서 내 차례가 오고, 공을 던져 먼 곳에 있는 벽에 뚫린 참치 캔 모양 구멍에 넣는 게임을 했다.
            러닝 후 단백질 채울 욕심으로 승부욕에 불타 열심히 했다. 하지만, 운동 신경이 둔해진 탓일까? 참치 캔 1개를 받는 것에 그쳤다.
            그래도, 종합적으로 부스에서 얻어 가는 게 많았다.
        </ArticleText>

        <ArticleGallery :items="afterRunPhotos"/>

        <ArticleText>
            어느 정도 시간이 지났을 때, 무대에서 진행자가 축하 공연으로 온 가수의 라인업을 알렸다.
            먼저 남자 가수로는 존박님이 오셨다. 한로로의 '0+0', '네 생각' 등의 곡들을 불러주셨다. 나에게 건네주는 위로 같은 느낌을 받았다.
            가장 마음에 훅 들어온 가사는
        </ArticleText>

        <ArticleCallout title="한로로 '0+0'">
            아, 난 널 버리지 않아
            <br>
            너도 같은 생각이지?
            <br>
            난 우리를 영영 잃지 않아..
        </ArticleCallout>

        <ArticleText>
            곡 해석을 보기 전에는 연인을 붙잡는 말로 느꼈다. 0과 0이 만나도 숫자가 커지진 않는다. 하지만, 영원($\infty$)을 꿈꿀 수 있다.
            함께의 가치를 의미하던 것이다. 한로로 님이 '자몽살구클럽'이라는 소설과 같이 이 곡이 수록된 앨범을 만들었다고 한다.
            작가의 말에서 국어국문학 전공을 제대로 살리는 건 이번이 처음이라 엄청난 두려움에 떨며 책을 냈다고 한다.
            나 역시 이 포트폴리오를 통해 글, 수식, 웹 페이지 같은 다양한 매체로 스스로를 표현하며 느낀 감정이라 공감이 되었다.
        </ArticleText>

        <ArticleVideo
          :src="johnParkIntroVideo.src"
          :caption="johnParkIntroVideo.caption"
        />

        <ArticleText>
            여자 가수로는 리센느가 왔다. 예전에 SKALA 팀원들과 사이트에 나온 실루엣으로 카카오 엔터테인먼트 소속의 키키로 예측했었다.
            그런데 8만 원으로 이런 호사를 누릴 수 있다고 예상치도 못했다! 리센느에는 큰 관심이 없었는데, 최근에 '거제 야호'로 알게 되었다.
            뜬금없는 파라파라 춤과 낚시의 조합이 신선했다. 그런 우연함이야말로 가치가 있다고 생각한다.
            드디어 축제의 화룡점정인 리센느의 공연이 시작됐다. 들으면서 이 곡도 리센느 곡이었구나 알게 된 것들도 있었다.
            러닝하며 나도 모르게 덕택을 보고 있던 것이다. 무대 앞자리를 선점하지 못한 게 약간 아쉬웠다.
            청바지 재질의 멜빵에 흰 반팔 티를 입은 모습이 멀리서도 그 외모가 느껴졌다. 
            한 번씩 시원한 물 축포가 공연장의 열기를 식혀주고 분위기를 고조시켰다. 
            'Love Attack', 'Pretty Girl', 'Deja vu' 등 신나는 곡들로 무대가 끝이 났다. 
        </ArticleText>

        <ArticleVideo
          :src="ResceneIntroVideo.src"
          :caption="ResceneIntroVideo.caption"
        />

        <ArticleText>
            공연이 정리되고, 경품 추첨의 시간을 가졌다. 
            경품에 큰 미련이 없게 넉넉하게 받은 게 많기도 했고, 나가는 교통이 걱정되기도 해서 중간에 나왔다.
            차로 돌아가기 위해 탄천을 건너며 다리 아래 물가에서 잉어 무리를 맞닥뜨렸다.
            SKALA 시절, 탄천 러닝을 하며 만난 너구리와 참게와의 추억으로 마무리할 수 있는 축제였다.
        </ArticleText>
    </ArticleLayout>
</template>